---
kind: method
id: M:Autodesk.Revit.DB.CurveArray.GetEnumerator
source: html/ea03abed-f7eb-9c41-d925-a4b9b497d6cb.htm
---
# Autodesk.Revit.DB.CurveArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.